tutorial_cases/OF9/bdofoam_cases/nonreact/0.org/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "../constant/globalTransport"

Usy #codeStream
{
    code
    #{
        os<<$targetUs / $inletAlphaGas * $totalArea / $inletArea / $presfactor ;
    #}; 
};

internalField   uniform (0 $Usy 0);


boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type               pressureInletOutletVelocity;
        phi                phi.gas;
        value           $internalField;
    }
    walls
    {
        type               slip;
        //type               fixedValue;
        //value              uniform (0 0 0);
    }
}

// ************************************************************************* //
